{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,null,null,1],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"conv2d_Conv2D1","class_name":"Conv2D","config":{"filters":8,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D1","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"dropout_Dropout1","class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true},"inbound_nodes":[[["conv2d_Conv2D1",0,0,{}]]]},{"name":"conv2d_Conv2D2","class_name":"Conv2D","config":{"filters":8,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D2","trainable":true},"inbound_nodes":[[["dropout_Dropout1",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization1","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization1","trainable":true},"inbound_nodes":[[["conv2d_Conv2D2",0,0,{}]]]},{"name":"re_lu_ReLU1","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU1","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization1",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D1","class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D1","trainable":true},"inbound_nodes":[[["re_lu_ReLU1",0,0,{}]]]},{"name":"conv2d_Conv2D3","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D3","trainable":true},"inbound_nodes":[[["max_pooling2d_MaxPooling2D1",0,0,{}]]]},{"name":"dropout_Dropout2","class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout2","trainable":true},"inbound_nodes":[[["conv2d_Conv2D3",0,0,{}]]]},{"name":"conv2d_Conv2D4","class_name":"Conv2D","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D4","trainable":true},"inbound_nodes":[[["dropout_Dropout2",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization2","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization2","trainable":true},"inbound_nodes":[[["conv2d_Conv2D4",0,0,{}]]]},{"name":"re_lu_ReLU2","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU2","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization2",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D2","class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D2","trainable":true},"inbound_nodes":[[["re_lu_ReLU2",0,0,{}]]]},{"name":"conv2d_Conv2D5","class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D5","trainable":true},"inbound_nodes":[[["max_pooling2d_MaxPooling2D2",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization3","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization3","trainable":true},"inbound_nodes":[[["conv2d_Conv2D5",0,0,{}]]]},{"name":"re_lu_ReLU3","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU3","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization3",0,0,{}]]]},{"name":"dropout_Dropout3","class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout3","trainable":true},"inbound_nodes":[[["re_lu_ReLU3",0,0,{}]]]},{"name":"conv2d_Conv2D6","class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D6","trainable":true},"inbound_nodes":[[["dropout_Dropout3",0,0,{}]]]},{"name":"conv2d_transpose_Conv2DTranspose1","class_name":"Conv2DTranspose","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[2,2],"strides":[2,2],"padding":"same","data_format":"channels_last","activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_transpose_Conv2DTranspose1","trainable":true},"inbound_nodes":[[["conv2d_Conv2D6",0,0,{}]]]},{"name":"skip_Skip1","class_name":"Skip","config":{"name":"skip_Skip1","trainable":true},"inbound_nodes":[[["conv2d_Conv2D4",0,0,{}],["conv2d_transpose_Conv2DTranspose1",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization4","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization4","trainable":true},"inbound_nodes":[[["skip_Skip1",0,0,{}]]]},{"name":"re_lu_ReLU4","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU4","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization4",0,0,{}]]]},{"name":"conv2d_transpose_Conv2DTranspose2","class_name":"Conv2DTranspose","config":{"filters":8,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[2,2],"strides":[2,2],"padding":"same","data_format":"channels_last","activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_transpose_Conv2DTranspose2","trainable":true},"inbound_nodes":[[["re_lu_ReLU4",0,0,{}]]]},{"name":"skip_Skip2","class_name":"Skip","config":{"name":"skip_Skip2","trainable":true},"inbound_nodes":[[["conv2d_Conv2D2",0,0,{}],["conv2d_transpose_Conv2DTranspose2",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization5","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization5","trainable":true},"inbound_nodes":[[["skip_Skip2",0,0,{}]]]},{"name":"re_lu_ReLU5","class_name":"ReLU","config":{"max_value":null,"name":"re_lu_ReLU5","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization5",0,0,{}]]]},{"name":"conv2d_Conv2D7","class_name":"Conv2D","config":{"filters":5,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"linear","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D7","trainable":true},"inbound_nodes":[[["re_lu_ReLU5",0,0,{}]]]},{"name":"classify_Classify1","class_name":"Classify","config":{"name":"classify_Classify1","trainable":true},"inbound_nodes":[[["conv2d_Conv2D7",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["classify_Classify1",0,0]]},"keras_version":"tfjs-layers 4.17.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.17.0","convertedBy":null,"weightsManifest":[{"paths":["./text.weights.bin"],"weights":[{"name":"conv2d_Conv2D1/kernel","shape":[3,3,1,8],"dtype":"float32"},{"name":"conv2d_Conv2D1/bias","shape":[8],"dtype":"float32"},{"name":"conv2d_Conv2D2/kernel","shape":[3,3,8,8],"dtype":"float32"},{"name":"conv2d_Conv2D2/bias","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/gamma","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/beta","shape":[8],"dtype":"float32"},{"name":"conv2d_Conv2D3/kernel","shape":[3,3,8,16],"dtype":"float32"},{"name":"conv2d_Conv2D3/bias","shape":[16],"dtype":"float32"},{"name":"conv2d_Conv2D4/kernel","shape":[3,3,16,16],"dtype":"float32"},{"name":"conv2d_Conv2D4/bias","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/gamma","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/beta","shape":[16],"dtype":"float32"},{"name":"conv2d_Conv2D5/kernel","shape":[3,3,16,32],"dtype":"float32"},{"name":"conv2d_Conv2D5/bias","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/beta","shape":[32],"dtype":"float32"},{"name":"conv2d_Conv2D6/kernel","shape":[3,3,32,32],"dtype":"float32"},{"name":"conv2d_Conv2D6/bias","shape":[32],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose1/kernel","shape":[2,2,16,32],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose1/bias","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/beta","shape":[32],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose2/kernel","shape":[2,2,8,32],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose2/bias","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/gamma","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/beta","shape":[16],"dtype":"float32"},{"name":"conv2d_Conv2D7/kernel","shape":[1,1,16,5],"dtype":"float32"},{"name":"conv2d_Conv2D7/bias","shape":[5],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_mean","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_variance","shape":[8],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_mean","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_variance","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_variance","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization4/moving_variance","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/moving_mean","shape":[16],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization5/moving_variance","shape":[16],"dtype":"float32"}]}]}